# TonneForceMeters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..TonneForceMeters Property
UnitTypeId Class See Also
---
Tonne force meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId TonneForceMeters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TonneForceMeters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TonneForceMeters {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace